This sets a column's width in pixels
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public void SetColumnWidthInPixels(
	int nCol,
	int width
)
  Visual Basic
Public Sub SetColumnWidthInPixels ( _
	nCol As Integer, _
	width As Integer _
)
  Visual C++
public:
void SetColumnWidthInPixels(
	int nCol,
	int width
)
 Parameters
  nCol
 Type:  System Int32
  width
 Type:  System Int32
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   The given column number nCol is invalid. -or- The column width is outside of acceptable range.
 See Also
  TableSectionData Class
  Autodesk.Revit.DB Namespace